Долома/src/Catalogs/БыкиПлеменные/БыкиПлеменные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БыкиПлеменные</name>
  <predefined>
    <items>
      <name>НеопределенныйОтец</name>
      <description>Неопределенный отец</description>
    </items>
  </predefined>
  <attributes>
    <name>КодСемени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаботает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивное</name>
    <comment>Элемент находится в архиве. Учет по животному НЕ ведется.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КличкаНаЛатинице</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БетаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаппаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяКличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родословная</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
</mdclass:Catalog>

Долома/src/Enums/ПолЖивотного/ПолЖивотного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолЖивотного</name>
  <enumValues>
    <name>Корова</name>
  </enumValues>
  <enumValues>
    <name>Бык</name>
  </enumValues>
</mdclass:Enum>

Долома/src/Catalogs/РодословнаяЖивотных/РодословнаяЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РодословнаяЖивотных</name>
  <attributes>
    <name>Отец</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
  <attributes>
    <name>Мать</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>Кличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КличкаНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейнаяПринадлежность</name>
    <type>
      <types>CatalogRef.Линии</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>Породность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомплексныйКласс</name>
    <type>
      <types>CatalogRef.КомплексныеКлассы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Масть</name>
    <type>
      <types>CatalogRef.Масти</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСемени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БиркаХорриот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БетаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаппаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Долома/src/Catalogs/БыкиПлеменные/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	ЗаписатьРодословную = Ложь;
	Если НЕ ЗначениеЗаполнено(Родословная) Тогда
		РодословнаяОбъект = Справочники.РодословнаяЖивотных.СоздатьЭлемент();
		ЗаписатьРодословную = Истина;
	ИначеЕсли Наименование <> Родословная.Наименование Тогда	
		РодословнаяОбъект = Родословная.ПолучитьОбъект(); 
		ЗаписатьРодословную = Истина;
	КонецЕсли;
	
	Если ЗаписатьРодословную Тогда
		РодословнаяОбъект.Наименование 			= Наименование;
		РодословнаяОбъект.Пол 					= Перечисления.ПолЖивотного.Бык;
		РодословнаяОбъект.Кличка 				= Кличка;
		РодословнаяОбъект.КличкаНаАнглийском 	= КличкаНаЛатинице;
		РодословнаяОбъект.ДатаРождения			= ДатаРождения;
		РодословнаяОбъект.Порода                = Порода;
		РодословнаяОбъект.КодСемени             = КодСемени;
		РодословнаяОбъект.Записать(); 
		
		Родословная = РодословнаяОбъект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры
